"""Для какого наименьшего натурального числа А формула
    (ДЕЛ(𝑥, 3) → ¬ДЕЛ(𝑥, 5)) ∨ (𝑥 + 𝐴 ≥ 70)
истинна при любом целом натуральном значении переменной х"""


def f(x, a):
    return ((x%3==0) <= (x%5!=0)) or (x+a>=70)


for a in range(1, 100):
    if all(f(x, a) for x in range(1, 100)):
        print(a)
        break
