''' https://inf-ege.sdamgia.ru/problem?id=8666
На числовой прямой даны два отрезка: P = [25; 50] и Q = [32; 47]. 
Укажите наибольшую возможную длину промежутка A, для которого формула
    (¬ (x  принадлежит  A) → (x  принадлежит  P)) → ((x  принадлежит  A) → (x  принадлежит  Q))
тождественно истинна, то есть принимает значение 1 при любом значении переменной х.'''

def f(x, a1, a2):
    return ((not(a1<=x<=a2))<=(25<=x<=50)) <= ((a1<=x<=a2)<=(32<=x<=47))


L, R = 24.0, 51.0
max_d = 0

a1 = L
while a1 <= R:
    a1 += .2

    a2 = a1 + 0.1
    while a2 <= R:
        a2 += .2

        x = L
        while x <= R:
            x += .1
            if f(x,a1,a2) == False:
                break
        else:
            max_d = max(max_d, a2-a1)

print(round(max_d, 2))
