'''
Значение выражения 
...
записали в СС с основанием 16
Сколько значащих нулей содержится в этой записи?
'''

f = 3*4**38 + 2*4**23 + 4**20 + 3*4**5 + 2*4**4 + 1
print(f)
h = hex(f)
h = h[2:].upper()
print(h)
print(h.count('0'))

# = = = = = = = = = = = = 

# f = 2*16**2 + 1
# print(f)
# h = hex(f)
# print(h[2:])

f = 3*16**19 + 8*16**11 + 1*16**10 + 12*16**2 + 2*16**2 + 1
f = 3*16**19 + 8*16**11 + 1*16**10 + 14*16**2 + 1*16**0
print(f)
h = hex(f)
print(h[2:].upper())

